In [1]:
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [2]:
titles = pd.read_csv('data/titles.csv', index_col=None)
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [3]:
cast = pd.read_csv('data/cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### What are the ten most common movie names of all time?

In [13]:
titles.groupby(by=['title']).size().reset_index(name='count').sort_values(['count'], ascending=False).head(10)

                       title  count
68700                 Hamlet     18
29026                 Carmen     16
107353               Macbeth     15
181730          The Outsider     12
111490                  Maya     12
60758                Freedom     11
186398  The Three Musketeers     11
167338            Temptation     11
129629               Othello     11
90667                 Kismet     11

### Which three years in the 1930s saw the most films released?

In [24]:
titles['decade'] = titles['year']//10 * 10
grouped = titles[titles['decade'] == 1930].groupby(['year']).size()
grouped

year
1930     820
1931     886
1932     936
1933     894
1934     966
1935    1054
1936    1138
1937    1196
1938    1129
1939    1078
dtype: int64

In [26]:
grouped.reset_index(name='count').sort_values(['count'], ascending=False).head(3)

   year  count
7  1937   1196
6  1936   1138
8  1938   1129

### Count the number of films that have been released in each decade over the history of cinema.

In [27]:
titles['decade'] = titles['year']//10 * 10
titles.groupby(['decade']).size()

decade
1890        3
1900       37
1910     6512
1920     8797
1930    10097
1940     8576
1950    12711
1960    17515
1970    18714
1980    20243
1990    22225
2000    38713
2010    67977
2020      210
dtype: int64

### Count the number of "Hamlet" films made in each decade.

In [29]:
filtered = titles[titles['title'] == 'Hamlet']
filtered

         title  year  decade
6009    Hamlet  1948    1940
45350   Hamlet  1990    1990
46721   Hamlet  1910    1910
92146   Hamlet  1976    1970
94355   Hamlet  1987    1980
94554   Hamlet  2000    2000
98554   Hamlet  1921    1920
102919  Hamlet  2011    2010
122704  Hamlet  1969    1960
128388  Hamlet  1954    1950
166410  Hamlet  1913    1910
168965  Hamlet  2015    2010
176069  Hamlet  2009    2000
182970  Hamlet  1964    1960
201291  Hamlet  1996    1990
209878  Hamlet  1911    1910
221479  Hamlet  1973    1970
223568  Hamlet  2014    2010

In [31]:
grouped = filtered.groupby(['decade'])
grouped.size()

decade
1910    3
1920    1
1940    1
1950    1
1960    2
1970    2
1980    1
1990    2
2000    2
2010    3
dtype: int64

### Count the number of "Rustler" characters in each decade of the history of film.

In [34]:
cast['decade'] = cast['year']//10 * 10
filtered = cast[cast['character'] == 'Rustler']
filtered.groupby(['decade']).size()

decade
1920     6
1930    84
1940    18
1950     8
1960     2
1970     9
1980     1
1990     4
2000     2
dtype: int64

### Count the number of "Hamlet" characters in each decade.

In [35]:
filtered = cast[cast['character'] == 'Hamlet']
filtered.groupby(['decade']).size()

decade
1910     6
1920     1
1930     6
1940     1
1950     3
1960     7
1970     8
1980     2
1990    11
2000    19
2010    28
dtype: int64

### What are the 11 most common character names in movie history?

In [40]:
cast.groupby(['character']).size().reset_index(name='count').sort_values(['count'], ascending=False).head(11)

           character  count
596245       Himself  19600
312006        Dancer  12096
444668         Extra  10953
1193823     Reporter   8154
358655        Doctor   7436
1344495      Student   7177
1131590    Policeman   6883
1090559  Party Guest   6742
1048474        Nurse   6676
122790     Bartender   6613
949925    Minor Role   6255

### Who are the 10 people most often credited as "Herself" in film history?

In [42]:
filtered = cast[cast['character'] == 'Herself']
filtered.groupby(['name']).size().reset_index(name='count').sort_values(['count'], ascending=False).head(10)

                    name  count
4163  Queen Elizabeth II     11
2397      Joyce Brothers      9
3247   Margaret Thatcher      8
1966     Hillary Clinton      7
3443        Mary Jo Pehl      7
2343         Joan Rivers      6
4823         Sumie Sakai      6
713         Bunny Yeager      5
2500      Kareena Kapoor      5
4245               Rekha      5

### Who are the 10 people most often credited as "Himself" in film history?

In [43]:
filtered = cast[cast['character'] == 'Himself']
filtered.groupby(['name']).size().reset_index(name='count').sort_values(['count'], ascending=False).head(10)

                        name  count
179             Adolf Hitler    100
12756          Richard Nixon     46
13241          Ronald Reagan     39
7974         John F. Kennedy     34
15929      Winston Churchill     24
1346        Benito Mussolini     23
13217             Ron Jeremy     23
5520          George W. Bush     23
10109     Martin Luther King     21
5122   Franklin D. Roosevelt     20

In [ ]:
pd.DataFrame.size()

### Which actors or actresses appeared in the most movies in the year 1945?

In [46]:
filtered = cast[cast['year'] == 1945]
filtered.groupby(['name']).size().reset_index(name='count').sort_values(['count'], ascending=False).head(1)

              name  count
2118  Emmett Vogan     39

### Which actors or actresses appeared in the most movies in the year 1985?

In [47]:
filtered = cast[cast['year'] == 1985]
filtered.groupby(['name']).size().reset_index(name='count').sort_values(['count'], ascending=False).head(1)

            name  count
13334  Mammootty     22

### How many roles "Mammootty" has played in each year of his career.

In [48]:
filtered = cast[cast['name'] == 'Mammootty']
filtered.groupby(['year']).size()

year
1971     1
1980     2
1981     3
1982     7
1983    18
1984    16
1985    22
1986    18
1987     9
1988     7
1989    10
1990    15
1991     6
1992     3
1993     5
1994     5
1995     5
1996     3
1997     2
1998     4
1999     4
2000     7
2001     3
2002     3
2003     2
2004     8
2005     6
2006     8
2007     7
2008     9
2009    12
2010     9
2011     7
2012     7
2013     5
2014     6
2015     6
2016     4
2017     1
dtype: int64

### What are the 10 most frequent roles that start with the phrase "Patron in"?

In [52]:
filtered = cast[cast['character'].str.startswith('Patron in')]
filtered.groupby(['character']).size().reset_index(name='count').sort_values(['count'], ascending=False).head(10)

                       character  count
14       Patron in Frisky Rabbit     16
9   Patron in Chinese Restaurant      9
29    Patron in the Coffee House      9
4      Patron in Billiard Parlor      5
3                  Patron in Bar      4
28          Patron in restaurant      4
11                Patron in Club      3
22          Patron in Restaurant      3
27             Patron in cabaret      3
1             Patron in Audience      2

### What are the 10 most frequent roles that start with the word "Science"?

In [70]:
filtered = cast[cast['character'].str.startswith('Science')]
filtered.groupby(['character']).agg(['size']).sort_values(('title','size'), ascending=False).head(10)

                     title year name type    n decade
                      size size size size size   size
character
Science Teacher         60   60   60   60   60     60
Science Student          9    9    9    9    9      9
Science Fair Student     9    9    9    9    9      9
Science Fair Judge       6    6    6    6    6      6
Science Reporter         5    5    5    5    5      5
Science Promo Cadet      5    5    5    5    5      5
Science Club Member      5    5    5    5    5      5
Science Kid              5    5    5    5    5      5
Science                  4    4    4    4    4      4
Science Officer          3    3    3    3    3      3

In [72]:
filtered = cast[cast['character'].str.startswith('Science')]
filtered.groupby(['character']).size().reset_index(name='count').sort_values(['count'], ascending=False).head(10)

               character  count
54       Science Teacher     60
53       Science Student      9
24  Science Fair Student      9
14    Science Fair Judge      6
51      Science Reporter      5
50   Science Promo Cadet      5
7    Science Club Member      5
31           Science Kid      5
0                Science      4
40       Science Officer      3

### Count number of n-values of the roles that Judi Dench has played over her career.

In [54]:
filtered = cast[cast['name'] == 'Judi Dench']
filtered.groupby(['n']).size()

n
1.0     6
2.0     6
3.0     6
4.0     4
5.0     2
6.0     4
7.0     4
8.0     1
9.0     1
12.0    3
13.0    2
16.0    2
18.0    2
20.0    1
23.0    1
26.0    1
29.0    1
40.0    1
dtype: int64

### Count number of n-values of Cary Grant's roles through his career.

In [55]:
filtered = cast[cast['name'] == 'Cary Grant']
filtered.groupby(['n']).size()

n
1.0     46
2.0     20
3.0      2
4.0      1
5.0      1
8.0      1
9.0      2
10.0     2
dtype: int64

### Count number of n-value of the roles that Sidney Poitier has acted over the years.

In [56]:
filtered = cast[cast['name'] == 'Sidney Poitier']
filtered.groupby(['n']).size()

n
1.0     21
2.0      8
3.0      6
4.0      3
5.0      1
10.0     1
13.0     1
21.0     1
dtype: int64

### How many leading (n=1) roles were available to actors, and how many to actresses, in the 1950s?

In [63]:
filtered = cast[(cast['decade'] == 1950) & (cast['n'] == 1)]
filtered.groupby('type').size()

type
actor      6616
actress    2965
dtype: int64

### How many supporting (n=2) roles were available to actors, and how many to actresses, in the 1950s?

In [64]:
filtered = cast[(cast['decade'] == 1950) & (cast['n'] == 2)]
filtered.groupby('type').size()

type
actor      4564
actress    4556
dtype: int64